<?php
return [
    'reports' =>    [
                        'learnMore' => 'Дізнатись більше...',
                        'try' => 'Спробувати',
                        'mainDesc' => 'Laravel • Збереження до БД • Генерація PDF документа • Відправлення Email зі вкладення PDF документа',
                        'screenAlt_1' => 'Створення підпису клієнта',
                        'screenText_1' => 'Підпис клієнта',
                        'screenAlt_2' => 'Генерація PDF',
                        'screenText_2' => 'Генерація PDF документа і попередній перегляд',
                        'screenDesc_1' => 'Підтримка підпису за допомогою мишки або пальця на сенсорних екранах.',
                        'screenDesc_2' => 'Інтерфейс для генерації PDF-звіту та можливість попереднього перегляду перед відправкою електронною поштою.',
                        'back' => 'Повернутись на головну',
                        'mainTitle' => 'Тестова форма репорту',
                    ],
];