<?php

return [

    'accepted' => 'Поле :attribute повинно бути прийняте.',
    'accepted_if' => 'Поле :attribute повинно бути прийняте, коли :other дорівнює :value.',
    'active_url' => 'Поле :attribute повинно бути дійсною URL-адресою.',
    'after' => 'Поле :attribute повинно містити дату після :date.',
    'after_or_equal' => 'Поле :attribute повинно містити дату після або рівну :date.',
    'alpha' => 'Поле :attribute повинно містити лише літери.',
    'alpha_dash' => 'Поле :attribute може містити лише літери, цифри, дефіси та підкреслення.',
    'alpha_num' => 'Поле :attribute повинно містити лише літери та цифри.',
    'array' => 'Поле :attribute повинно бути масивом.',
    'ascii' => 'Поле :attribute повинно містити лише однобайтові символи.',
    'before' => 'Поле :attribute повинно містити дату до :date.',
    'before_or_equal' => 'Поле :attribute повинно містити дату до або рівну :date.',
    'between' => [
        'array' => 'Поле :attribute повинно містити від :min до :max елементів.',
        'file' => 'Поле :attribute повинно бути від :min до :max кілобайт.',
        'numeric' => 'Поле :attribute повинно бути між :min та :max.',
        'string' => 'Поле :attribute повинно містити від :min до :max символів.',
    ],
    'boolean' => 'Поле :attribute повинно бути true або false.',
    'confirmed' => 'Підтвердження поля :attribute не співпадає.',
    'date' => 'Поле :attribute повинно бути коректною датою.',
    'date_equals' => 'Поле :attribute повинно бути датою, рівною :date.',
    'date_format' => 'Поле :attribute повинно відповідати формату :format.',
    'decimal' => 'Поле :attribute повинно містити :decimal знаків після коми.',
    'declined' => 'Поле :attribute повинно бути відхилене.',
    'distinct' => 'Поле :attribute містить повторюване значення.',
    'email' => 'Поле :attribute повинно бути дійсною електронною адресою.',
    'exists' => 'Обране значення для :attribute є недійсним.',
    'file' => 'Поле :attribute повинно бути файлом.',
    'filled' => 'Поле :attribute повинно мати значення.',
    'gt' => [
        'numeric' => 'Поле :attribute повинно бути більше :value.',
        'file' => 'Поле :attribute повинно бути більше :value кілобайт.',
        'string' => 'Поле :attribute повинно містити більше :value символів.',
        'array' => 'Поле :attribute повинно містити більше ніж :value елементів.',
    ],
    'gte' => [
        'numeric' => 'Поле :attribute повинно бути не менше :value.',
        'file' => 'Поле :attribute повинно бути не менше :value кілобайт.',
        'string' => 'Поле :attribute повинно містити не менше :value символів.',
        'array' => 'Поле :attribute повинно містити :value елементів або більше.',
    ],
    'image' => 'Поле :attribute повинно бути зображенням.',
    'in' => 'Обране значення для :attribute є недійсним.',
    'integer' => 'Поле :attribute повинно бути цілим числом.',
    'json' => 'Поле :attribute повинно бути коректним JSON рядком.',
    'max' => [
        'numeric' => 'Поле :attribute не повинно бути більше :max.',
        'file' => 'Поле :attribute не повинно перевищувати :max кілобайт.',
        'string' => 'Поле :attribute не повинно перевищувати :max символів.',
        'array' => 'Поле :attribute не повинно містити більше ніж :max елементів.',
    ],
    'mimes' => 'Поле :attribute повинно бути файлом типу: :values.',
    'min' => [
        'numeric' => 'Поле :attribute повинно бути не менше :min.',
        'file' => 'Поле :attribute повинно бути не менше :min кілобайт.',
        'string' => 'Поле :attribute повинно містити щонайменше :min символів.',
        'array' => 'Поле :attribute повинно містити щонайменше :min елементів.',
    ],
    'not_in' => 'Обране значення для :attribute є недійсним.',
    'numeric' => 'Поле :attribute повинно бути числом.',
    'regex' => 'Формат поля :attribute є недійсним.',
    'required' => 'Поле :attribute є обовʼязковим.',
    'same' => 'Поле :attribute повинно збігатися з полем :other.',
    'size' => [
        'numeric' => 'Поле :attribute повинно бути розміром :size.',
        'file' => 'Поле :attribute повинно бути розміром :size кілобайт.',
        'string' => 'Поле :attribute повинно містити :size символів.',
        'array' => 'Поле :attribute повинно містити :size елементів.',
    ],
    'string' => 'Поле :attribute повинно бути рядком.',
    'timezone' => 'Поле :attribute повинно бути дійсною часовою зоною.',
    'unique' => 'Таке значення поля :attribute вже існує.',
    'uploaded' => 'Не вдалося завантажити файл :attribute.',
    'url' => 'Поле :attribute повинно бути дійсною URL-адресою.',

    /*
    |--------------------------------------------------------------------------
    | Користувацькі повідомлення
    |--------------------------------------------------------------------------
    */

    'custom' => [
        'customerName' => [
            'required' => 'Будь ласка, виберіть замовника.',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Імена атрибутів
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'customerName' => 'ім’я замовника',
        'date.*' => 'дата',
        'transportKm' => 'кілометри транспортування',
        'transportTime' => 'час транспортування',
        'technikName.*' => 'ім’я техніка',
        'startTime.*' => 'початок роботи',
        'finishTime.*' => 'завершення роботи',
        'description' => 'опис',
        'descriptionResult' => 'опис результату',
        'mainTech' => 'ім’я головного техніка',
        'nameCustomerSign' => 'ім’я відповідальної особи',
    ],

];
